Revit 2023 API
RebarContainer.ClearItems Method
 Clears all the Items stored in this Rebar Container element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public void ClearItems()
Visual Basic
Public Sub ClearItems
Visual C++
public:
void ClearItems()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace